<a href="https://colab.research.google.com/github/ClaudiaGonzalezScanu/aprendiendo_python/blob/main/Clase_Miercoles17_11_21_cmpleto1.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

Importar las librerías

In [ ]:
import pandas as pd 
import numpy as np

Creamos un DataFrame:

In [ ]:
Nombre_Edad = {'Nombre' : ['Juan', 'Ana', 'Pablo', 'Rene', 'Orlando','Marta'], 
               'Edad' : [32, None, 20, 43, 30,35],
               'Puntaje': [9.4,7.1,4.5,5.6,3.2,6.8]} 
df = pd.DataFrame(Nombre_Edad) 
df

    Nombre  Edad  Puntaje
0     Juan  32.0      9.4
1      Ana   NaN      7.1
2    Pablo  20.0      4.5
3     Rene  43.0      5.6
4  Orlando  30.0      3.2
5    Marta  35.0      6.8

Ver los valores de una columna del DataFrame

In [ ]:
df['Nombre']

0       Juan
1        Ana
2      Pablo
3       Rene
4    Orlando
5      Marta
Name: Nombre, dtype: object

Realizar un rebanado (slicing) sobre la columna "Nombre"

In [ ]:
df['Nombre'][0:4]

0     Juan
1      Ana
2    Pablo
3     Rene
Name: Nombre, dtype: object

In [ ]:
df['Nombre'][2:4]

2    Pablo
3     Rene
Name: Nombre, dtype: object

Mostrar una o más columnas de un DataFrame:

In [ ]:
df[['Nombre','Puntaje']]

    Nombre  Puntaje
0     Juan      9.4
1      Ana      7.1
2    Pablo      4.5
3     Rene      5.6
4  Orlando      3.2
5    Marta      6.8

Crear un nuevo DataFrame a partir de las columnas de un DataFrame previamente definido:

In [ ]:
new_df=df[['Nombre','Puntaje']]
new_df

    Nombre  Puntaje
0     Juan      9.4
1      Ana      7.1
2    Pablo      4.5
3     Rene      5.6
4  Orlando      3.2
5    Marta      6.8

Se utiliza el método **iloc** para ver una o varias filas de un DataFrame o para ver un valor determinado dentro del DataFrame (recordar que filas y columnas inician su indexación a partir de cero):

In [ ]:
df.iloc[0:3]

  Nombre  Edad  Puntaje
0   Juan    32      9.4
1    Ana    55      7.1
2  Pablo    20      4.5

In [ ]:
df.iloc[1,2]

7.1

In [ ]:
df.iloc[2,2]

4.5

Filtrar el DataFrame:

In [ ]:
df[(df["Puntaje"]>=6.0)]

  Nombre  Edad  Puntaje
0   Juan  32.0      9.4
1    Ana   NaN      7.1
5  Marta  35.0      6.8

In [ ]:
df[(df["Puntaje"]>=6.0) & (df["Edad"]<40)]

  Nombre  Edad  Puntaje
0   Juan  32.0      9.4
5  Marta  35.0      6.8

Examinar un DataFrame:

In [ ]:
df.describe()

            Edad   Puntaje
count   5.000000  6.000000
mean   32.000000  6.100000
std     8.336666  2.172556
min    20.000000  3.200000
25%    30.000000  4.775000
50%    32.000000  6.200000
75%    35.000000  7.025000
max    43.000000  9.400000

In [ ]:
df.head(2)

  Nombre  Edad  Puntaje
0   Juan  32.0      9.4
1    Ana   NaN      7.1

In [ ]:
df.tail(2)

    Nombre  Edad  Puntaje
4  Orlando  30.0      3.2
5    Marta  35.0      6.8

In [ ]:
df.shape

(6, 3)

In [ ]:
df.columns

Index(['Nombre', 'Edad', 'Puntaje'], dtype='object')

In [ ]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 6 entries, 0 to 5
Data columns (total 3 columns):
 #   Column   Non-Null Count  Dtype
---  ------   --------------  -----
 0   Nombre   6 non-null      object
 1   Edad     5 non-null      float64
 2   Puntaje  6 non-null      float64
dtypes: float64(2), object(1)
memory usage: 272.0+ bytes

In [ ]:
df.head(5).tail(1)

    Nombre  Edad  Puntaje
4  Orlando  30.0      3.2

Importar DataFrames usando PANDA

In [ ]:
import os,sys
os.getcwd()

'/content'

In [ ]:
from google.colab import files
files.upload()

Saving Presion_Sistolica.csv to Presion_Sistolica.csv

{'Presion_Sistolica.csv': b'Index,One,Age,Systolic blood pressure\n1,1,39,144\n2,1,45,138\n3,1,47,145\n4,1,65,162\n5,1,46,142\n6,1,67,170\n7,1,42,124\n8,1,67,158\n9,1,56,154\n10,1,64,162\n11,1,56,150\n12,1,59,140\n13,1,34,110\n14,1,42,128\n15,1,48,130\n16,1,45,135\n17,1,17,114\n18,1,20,116\n19,1,19,124\n20,1,36,136\n21,1,50,142\n22,1,39,120\n23,1,21,120\n24,1,44,160\n25,1,53,158\n26,1,63,144\n27,1,29,130\n28,1,25,125\n29,1,69,175'}

In [ ]:
import pandas as pd
df=pd.read_csv("Presion_Sistolica.csv")
df

    Index  One  Age  Systolic blood pressure
0       1    1   39                      144
1       2    1   45                      138
2       3    1   47                      145
3       4    1   65                      162
4       5    1   46                      142
5       6    1   67                      170
6       7    1   42                      124
7       8    1   67                      158
8       9    1   56                      154
9      10    1   64                      162
10     11    1   56                      150
11     12    1   59                      140
12     13    1   34                      110
13     14    1   42                      128
14     15    1   48                      130
15     16    1   45                      135
16     17    1   17                      114
17     18    1   20                      116
18     19    1   19                      124
19     20    1   36                      136
20     21    1   50                      142
21     22    1   39                      120
22     23    1   21                      120
23     24    1   44                      160
24     25    1   53                      158
25     26    1   63                      144
26     27    1   29                      130
27     28    1   25                      125
28     29    1   69                      175

In [ ]:
!ls -l sample_data

total 55504
-rwxr-xr-x 1 root root     1697 Jan  1  2000 anscombe.json
-rw-r--r-- 1 root root   301141 Nov  1 13:35 california_housing_test.csv
-rw-r--r-- 1 root root  1706430 Nov  1 13:35 california_housing_train.csv
-rw-r--r-- 1 root root 18289443 Nov  1 13:35 mnist_test.csv
-rw-r--r-- 1 root root 36523880 Nov  1 13:35 mnist_train_small.csv
-rwxr-xr-x 1 root root      930 Jan  1  2000 README.md

In [ ]:
df=pd.read_csv("/content/sample_data/california_housing_train.csv")
df

       longitude  latitude  ...  median_income  median_house_value
0        -114.31     34.19  ...         1.4936             66900.0
1        -114.47     34.40  ...         1.8200             80100.0
2        -114.56     33.69  ...         1.6509             85700.0
3        -114.57     33.64  ...         3.1917             73400.0
4        -114.57     33.57  ...         1.9250             65500.0
...          ...       ...  ...            ...                 ...
16995    -124.26     40.58  ...         2.3571            111400.0
16996    -124.27     40.69  ...         2.5179             79000.0
16997    -124.30     41.84  ...         3.0313            103600.0
16998    -124.30     41.80  ...         1.9797             85800.0
16999    -124.35     40.54  ...         3.0147             94600.0

[17000 rows x 9 columns]

In [ ]:
df.head(10)

   longitude  latitude  ...  median_income  median_house_value
0    -114.31     34.19  ...         1.4936             66900.0
1    -114.47     34.40  ...         1.8200             80100.0
2    -114.56     33.69  ...         1.6509             85700.0
3    -114.57     33.64  ...         3.1917             73400.0
4    -114.57     33.57  ...         1.9250             65500.0
5    -114.58     33.63  ...         3.3438             74000.0
6    -114.58     33.61  ...         2.6768             82400.0
7    -114.59     34.83  ...         1.7083             48500.0
8    -114.59     33.61  ...         2.1782             58400.0
9    -114.60     34.83  ...         2.1908             48100.0

[10 rows x 9 columns]